
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    // Автоматизация заполнения полей по умолчанию
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Константы.ОсновнаяОрганизация.Получить();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ТабличнаяЧастьПолучитьКурсВалютыНаСервере(ТекВалюта, ТекДата)
	Если ТекВалюта = Справочники.Валюты.Рубль Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |   КурсыВалют.Период КАК Период,
        |   КурсыВалют.Валюта КАК Валюта,
        |   КурсыВалют.Курс КАК Курс,
        |   КурсыВалют.Кратность КАК Кратность
        |ИЗ
        |   РегистрСведений.КурсыВалют.СрезПоследних(&ПарПериод, Валюта = &ПарВалюта) КАК КурсыВалют";
	
    Запрос.УстановитьПараметр("ПарВалюта", ТекВалюта);
	Запрос.УстановитьПараметр("ПарПериод", ТекДата);

    Выборка = Запрос.Выполнить().Выбрать();

    Результат = Новый Структура("Курс, Кратность", 0, 1);

    Если Выборка.Следующий() Тогда
        Результат.Курс = Выборка.Курс;
        Результат.Кратность = Выборка.Кратность;
    КонецЕсли;

    Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ТабличнаяЧастьВалютаПриИзменении(Элемент)
    ТекДанные = Элементы.ТабличнаяЧасть.ТекущиеДанные;
    Если ТекДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
	
	
    Результат = ТабличнаяЧастьПолучитьКурсВалютыНаСервере(ТекДанные.Валюта, Объект.Дата); 
	
	Если Результат <> ЛОЖЬ Тогда
	    ТекДанные.Курс = Результат.Курс;
	    ТекДанные.Кратность = Результат.Кратность;
		ТабличнаяЧастьПосчитатьСумму(Элемент);
	Иначе
        ПоказатьПредупреждение(, "Нельзя выбирать предопределённые валюты (рубль).");
        ТекДанные.Валюта = Неопределено;
        ТекДанные.Курс = Неопределено;
        ТекДанные.Кратность = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПосчитатьСумму(Элемент)
    ТекДанные = Элементы.ТабличнаяЧасть.ТекущиеДанные;
    Если ТекДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
	
	ТекДанные.Сумма = Окр(ТекДанные.Курс * ТекДанные.Количество,2,РежимОкругления.Окр15как10);
    ТабличнаяЧастьПриИзменении(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧастьПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.ТабличнаяЧасть.Итог("Сумма");
	СуммаДокументаПрописью = РаботаСДокументамиКлиент.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СуммаДокументаПрописью = РаботаСДокументамиКлиент.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
КонецПроцедуры

