
Процедура Печать(ТабДок, Ссылка) Экспорт
	Макет = Документы.ПродажаВалюты.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПродажаВалюты.Дата,
	|	ПродажаВалюты.Комментарий,
	|	ПродажаВалюты.Контрагент,
	|	ПродажаВалюты.Номер,
	|	ПродажаВалюты.Организация,
	|	ПродажаВалюты.СуммаДокумента,
	|	ПродажаВалюты.ТабличнаяЧасть.(
	|		НомерСтроки,
	|		Валюта,
	|		Курс,
	|		Кратность,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ПродажаВалюты КАК ПродажаВалюты
	|ГДЕ
	|	ПродажаВалюты.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТабличнаяЧастьШапка = Макет.ПолучитьОбласть("ТабличнаяЧастьШапка");
	ОбластьТабличнаяЧасть = Макет.ПолучитьОбласть("ТабличнаяЧасть");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТабличнаяЧастьШапка);
		ВыборкаТабличнаяЧасть = Выборка.ТабличнаяЧасть.Выбрать();
		Пока ВыборкаТабличнаяЧасть.Следующий() Цикл
			ОбластьТабличнаяЧасть.Параметры.Заполнить(ВыборкаТабличнаяЧасть);
			ТабДок.Вывести(ОбластьТабличнаяЧасть, ВыборкаТабличнаяЧасть.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);

	    // Получаем сумму прописью
	    СуммаПрописью = РаботаСДокументамиСервер.ИтоговоеЧислоПрописью(Выборка.СуммаДокумента);

	    // Передаём в параметр макета
	    Подвал.Параметры.СуммаДокументаПрописью = СуммаПрописью;
		
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
