
Процедура ЗадатьВопросПользователю(Отказ) Экспорт
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос("Вы уверены, что хотите выполнить это действие?
	|При выполнении могут быть безвозвратно утеряны данные!", Режим, 10, 
	КодВозвратаДиалога.Нет, "Внимание!", КодВозвратаДиалога.Нет);
	
	Если Ответ = КодВозвратаДиалога.Нет ИЛИ Ответ = КодВозвратаДиалога.Таймаут Тогда
		//Возвращаем - отказ от выполнения
		Отказ = Истина;
	Иначе
		Отказ = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗадатьПроизвольныйВопросПользователю(ТекстВопроса,Отказ) Экспорт
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос(ТекстВопроса, Режим, 10,	КодВозвратаДиалога.Нет, "Внимание!", КодВозвратаДиалога.Нет);
	
	Если Ответ = КодВозвратаДиалога.Нет ИЛИ Ответ = КодВозвратаДиалога.Таймаут Тогда
		//Возвращаем - отказ от выполнения
		Отказ = Истина;
	Иначе
		Отказ = Ложь;
	КонецЕсли;
	
КонецПроцедуры


Функция ИтоговоеЧислоПрописью(СуммаИтого) Экспорт   
	
	Если СуммаИтого > 0 Тогда
		
		ФормСтрока = "Л = ru_RU; ДП = Ложь";
		ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
		ПрописьЧисла = ЧислоПрописью(СуммаИтого, ФормСтрока, ПарПредмета);
	
		СуммаИтогоПрописью = "Итого: " + ПрописьЧисла + ".";
		
	Иначе
		СуммаИтогоПрописью = "<< >>";
	КонецЕсли;
	
	Возврат СуммаИтогоПрописью;
	
КонецФункции
