
&НаКлиенте
Процедура Печать(Команда) 
	// Вставить содержимое обработчика.
	ТабДок = Новый ТабличныйДокумент;
	ПечатьНаСервере(ТабДок);
	ТабДок.Показать("Карточка организации");
КонецПроцедуры


&НаСервере
Функция ПечатьНаСервере(ТабДок)
	// Вставить содержимое обработчика.
	Макет = ПолучитьОбщийМакет("КарточкаПредприятия");
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапки.Параметры.ПНаименование = Константы.ОргНаименование.Получить();
	ОбластьШапки.Параметры.КНаименование = Константы.ОргНаименованиеСокращенное.Получить();
	ОбластьШапки.Параметры.ЮАдрес = Константы.ОргЮрАдрес.Получить();
	ОбластьШапки.Параметры.ПАдрес = Константы.ОргПочтовыйАдрес.Получить();
	ОбластьШапки.Параметры.РС = Константы.ОргРасчетныйСчет.Получить();
	ОбластьШапки.Параметры.КоррСчет = Константы.ОргКоррСчет.Получить();
	ОбластьШапки.Параметры.ФИО = Константы.ОргРуководительФИО.Получить();
	ОбластьШапки.Параметры.Должность = Константы.ОргРуководительДолжность.Получить();
	ОбластьШапки.Параметры.ИНН = Константы.ОргИНН.Получить();
	ОбластьШапки.Параметры.КПП = Константы.ОргКПП.Получить();
	ОбластьШапки.Параметры.ОГРН = Константы.ОргОГРН.Получить();
	ОбластьШапки.Параметры.ОКВЭД = Константы.ОргОКВЭД.Получить();
	ОбластьШапки.Параметры.ОКПО = Константы.ОргОКПО.Получить();
	ОбластьШапки.Параметры.ОКАТО = Константы.ОргОКАТО.Получить();
	ОбластьШапки.Параметры.Web = Константы.ОргВебСайт.Получить();
	ОбластьШапки.Параметры.Тел = Константы.ОргТелефон.Получить();
	ОбластьШапки.Параметры.ЭлПочта = Константы.ОргЭлПочта.Получить();
	ТабДок.Вывести(ОбластьШапки);
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьИнтерфейс();
КонецПроцедуры
