
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
    Если ИмяСобытия = "ОбновитьКурсыВалют" Тогда
        Элементы.Список.Обновить();
    КонецЕсли;
КонецПроцедуры       

&НаКлиенте
Процедура ЗагрузитьКурсыВалют(Команда)
	ОткрытьФорму("Обработка.ЗагрузкаКурсовВалют.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ДинамикаКурсов(Команда)
	ОткрытьФорму("Отчет.КурсыВалют.Форма");
КонецПроцедуры


